#coding:utf-8

def my_sort(list_1):
    # 控制循环次数
    for i in list_1:
        for x in range(1,len(list_1)):
            '''
            演算推理过程：
            [22, 111, 13, 24, 55, 6, 73, 18]
            [22, 13, 111, 24, 55, 6, 73, 18]
            [22, 13, 24, 111, 55, 6, 73, 18]
            [22, 13, 24, 55, 111, 6, 73, 18]
            [22, 13, 24, 55, 6, 111, 73, 18]
            [22, 13, 24, 55, 6, 73, 111, 18]
            [22, 13, 24, 55, 6, 73, 18, 111]
            '''
            # 拿出第一个和第二个数字进行比较
            if list_1[x-1] < list_1[x]:
                # 调换两个数字的位置
                list_1[x-1],list_1[x] = list_1[x],list_1[x-1]

    return list_1      
        

sort_list = my_sort([111,22,13,24,55,6,73,18])

print sort_list


